aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_modem.h
// field definitions
#define MDM_BEFORE_TXSTART_MASK   ((uint32_t)0x000F0000)
#define MDM_BEFORE_TXSTART_LSB    16
#define MDM_BEFORE_TXSTART_WIDTH  ((uint32_t)0x00000004)
#define MDM_TX_STARTUPDEL_MASK    ((uint32_t)0x000000FF)
#define MDM_TX_STARTUPDEL_LSB     0
#define MDM_TX_STARTUPDEL_WIDTH   ((uint32_t)0x00000008)

#define MDM_BEFORE_TXSTART_RST    0x1
#define MDM_TX_STARTUPDEL_RST     0xB4

__INLINE void mdm_tx_startupdel_pack(uint8_t beforetxstart, uint8_t txstartupdel)
{
    ASSERT_ERR((((uint32_t)beforetxstart << 16) & ~((uint32_t)0x000F0000)) == 0);
    ASSERT_ERR((((uint32_t)txstartupdel << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(MDM_TX_STARTUPDEL_ADDR,  ((uint32_t)beforetxstart << 16) | ((uint32_t)txstartupdel << 0));
}

__INLINE void mdm_tx_startupdel_unpack(uint8_t* beforetxstart, uint8_t* txstartupdel)
{
    uint32_t localVal = REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR);

    *beforetxstart = (localVal & ((uint32_t)0x000F0000)) >> 16;
    *txstartupdel = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t mdm_before_txstart_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR);
    return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__INLINE void mdm_before_txstart_setf(uint8_t beforetxstart)
{
    ASSERT_ERR((((uint32_t)beforetxstart << 16) & ~((uint32_t)0x000F0000)) == 0);
    REG_RPL_WR(MDM_TX_STARTUPDEL_ADDR, (REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR) & ~((uint32_t)0x000F0000)) | ((uint32_t)beforetxstart << 16));
}

__INLINE uint8_t mdm_tx_startupdel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void mdm_tx_startupdel_setf(uint8_t txstartupdel)
{
    ASSERT_ERR((((uint32_t)txstartupdel << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(MDM_TX_STARTUPDEL_ADDR, (REG_RPL_RD(MDM_TX_STARTUPDEL_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)txstartupdel << 0));
}

/**
 * @brief TX_GFSKMODE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     01             FMTX2PEN   0
 *     00               FMTXEN   0
 * </pre>
 */
#define MDM_TX_GFSKMODE_ADDR   0x00000085
#define MDM_TX_GFSKMODE_OFFSET 0x00000085
#define MDM_TX_GFSKMODE_INDEX  0x00000021
#define MDM_TX_GFSKMODE_RESET  0x00000000

__INLINE uint32_t mdm_tx_gfskmode_get(void)
{
    return REG_RPL_RD(MDM_TX_GFSKMODE_ADDR);
}

__INLINE void mdm_tx_gfskmode_set(uint32_t value)
{
    REG_RPL_WR(MDM_TX_GFSKMODE_ADDR, value);
}

// field definitions
#define MDM_FMTX2PEN_BIT    ((uint32_t)0x00000002)
#define MDM_FMTX2PEN_POS    1
#define MDM_FMTXEN_BIT      ((uint32_t)0x00000001)
#define MDM_FMTXEN_POS      0

#define MDM_FMTX2PEN_RST    0x0
#define MDM_FMTXEN_RST      0x0

__INLINE void mdm_tx_gfskmode_pack(uint8_t fmtx2pen, uint8_t fmtxen)
{
    ASSERT_ERR((((uint32_t)fmtx2pen << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)fmtxen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(MDM_TX_GFSKMODE_ADDR,  ((uint32_t)fmtx2pen << 1) | ((uint32_t)fmtxen << 0));
}

__INLINE void mdm_tx_gfskmode_unpack(uint8_t* fmtx2pen, uint8_t* fmtxen)
{
    uint32_t localVal = REG_RPL_RD(MDM_TX_GFSKMODE_ADDR);

    *fmtx2pen = (localVal & ((uint32_t)0x00000002)) >> 1;
    *fmtxen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t mdm_fmtx2pen_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_TX_GFSKMODE_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void mdm_fmtx2pen_setf(uint8_t fmtx2pen)
{
    ASSERT_ERR((((uint32_t)fmtx2pen << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(MDM_TX_GFSKMODE_ADDR, (REG_RPL_RD(MDM_TX_GFSKMODE_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)fmtx2pen << 1));
}

__INLINE uint8_t mdm_fmtxen_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_TX_GFSKMODE_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void mdm_fmtxen_setf(uint8_t fmtxen)
{
    ASSERT_ERR((((uint32_t)fmtxen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(MDM_TX_GFSKMODE_ADDR, (REG_RPL_RD(MDM_TX_GFSKMODE_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)fmtxen << 0));
}

/**
 * @brief DIAGCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  07:00             DIAGCNTL   0x0
 * </pre>
 */
#define MDM_DIAGCNTL_ADDR   0x00000086
#define MDM_DIAGCNTL_OFFSET 0x00000086
#define MDM_DIAGCNTL_INDEX  0x00000021
#define MDM_DIAGCNTL_RESET  0x00000000

__INLINE uint32_t mdm_diagcntl_get(void)
{
    return REG_RPL_RD(MDM_DIAGCNTL_ADDR);
}

__INLINE void mdm_diagcntl_set(uint32_t value)
{
    REG_RPL_WR(MDM_DIAGCNTL_ADDR, value);
}

// field definitions
#define MDM_DIAGCNTL_MASK   ((uint32_t)0x000000FF)
#define MDM_DIAGCNTL_LSB    0
#define MDM_DIAGCNTL_WIDTH  ((uint32_t)0x00000008)

#define MDM_DIAGCNTL_RST    0x0

__INLINE uint8_t mdm_diagcntl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_DIAGCNTL_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000000FF)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_diagcntl_setf(uint8_t diagcntl)
{
    ASSERT_ERR((((uint32_t)diagcntl << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(MDM_DIAGCNTL_ADDR, (uint32_t)diagcntl << 0);
}

/**
 * @brief RX_PWR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  05:00                RXPWR   0x0
 * </pre>
 */
#define MDM_RX_PWR_ADDR   0x00000087
#define MDM_RX_PWR_OFFSET 0x00000087
#define MDM_RX_PWR_INDEX  0x00000021
#define MDM_RX_PWR_RESET  0x00000000

__INLINE uint32_t mdm_rx_pwr_get(void)
{
    return REG_RPL_RD(MDM_RX_PWR_ADDR);
}

__INLINE void mdm_rx_pwr_set(uint32_t value)
{
    REG_RPL_WR(MDM_RX_PWR_ADDR, value);
}

// field definitions
#define MDM_RXPWR_MASK   ((uint32_t)0x0000003F)
#define MDM_RXPWR_LSB    0
#define MDM_RXPWR_WIDTH  ((uint32_t)0x00000006)

#define MDM_RXPWR_RST    0x0

__INLINE uint8_t mdm_rxpwr_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RX_PWR_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000003F)) == 0);
    return (localVal >> 0);
}

/**
 * @brief RXFE_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     01             FE_DCCEN   1
 *     00             FE_FOCEN   1
 * </pre>
 */
#define MDM_RXFE_CNTL_ADDR   0x00000090
#define MDM_RXFE_CNTL_OFFSET 0x00000090
#define MDM_RXFE_CNTL_INDEX  0x00000024
#define MDM_RXFE_CNTL_RESET  0x00000003

__INLINE uint32_t mdm_rxfe_cntl_get(void)
{
    return REG_RPL_RD(MDM_RXFE_CNTL_ADDR);
}

__INLINE void mdm_rxfe_cntl_set(uint32_t value)
{
    REG_RPL_WR(MDM_RXFE_CNTL_ADDR, value);
}

