aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_modem.h
// field definitions
#define MDM_FE_DCCEN_BIT    ((uint32_t)0x00000002)
#define MDM_FE_DCCEN_POS    1
#define MDM_FE_FOCEN_BIT    ((uint32_t)0x00000001)
#define MDM_FE_FOCEN_POS    0

#define MDM_FE_DCCEN_RST    0x1
#define MDM_FE_FOCEN_RST    0x1

__INLINE void mdm_rxfe_cntl_pack(uint8_t fedccen, uint8_t fefocen)
{
    ASSERT_ERR((((uint32_t)fedccen << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)fefocen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(MDM_RXFE_CNTL_ADDR,  ((uint32_t)fedccen << 1) | ((uint32_t)fefocen << 0));
}

__INLINE void mdm_rxfe_cntl_unpack(uint8_t* fedccen, uint8_t* fefocen)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXFE_CNTL_ADDR);

    *fedccen = (localVal & ((uint32_t)0x00000002)) >> 1;
    *fefocen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t mdm_fe_dccen_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXFE_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void mdm_fe_dccen_setf(uint8_t fedccen)
{
    ASSERT_ERR((((uint32_t)fedccen << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(MDM_RXFE_CNTL_ADDR, (REG_RPL_RD(MDM_RXFE_CNTL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)fedccen << 1));
}

__INLINE uint8_t mdm_fe_focen_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXFE_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void mdm_fe_focen_setf(uint8_t fefocen)
{
    ASSERT_ERR((((uint32_t)fefocen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(MDM_RXFE_CNTL_ADDR, (REG_RPL_RD(MDM_RXFE_CNTL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)fefocen << 0));
}

/**
 * @brief FCS_IFMHZ register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  12:00           FE_IFSHIFT   0x276
 * </pre>
 */
#define MDM_FCS_IFMHZ_ADDR   0x00000091
#define MDM_FCS_IFMHZ_OFFSET 0x00000091
#define MDM_FCS_IFMHZ_INDEX  0x00000024
#define MDM_FCS_IFMHZ_RESET  0x00000276

__INLINE uint32_t mdm_fcs_ifmhz_get(void)
{
    return REG_RPL_RD(MDM_FCS_IFMHZ_ADDR);
}

__INLINE void mdm_fcs_ifmhz_set(uint32_t value)
{
    REG_RPL_WR(MDM_FCS_IFMHZ_ADDR, value);
}

// field definitions
#define MDM_FE_IFSHIFT_MASK   ((uint32_t)0x00001FFF)
#define MDM_FE_IFSHIFT_LSB    0
#define MDM_FE_IFSHIFT_WIDTH  ((uint32_t)0x0000000D)

#define MDM_FE_IFSHIFT_RST    0x276

__INLINE uint16_t mdm_fe_ifshift_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_FCS_IFMHZ_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00001FFF)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_fe_ifshift_setf(uint16_t feifshift)
{
    ASSERT_ERR((((uint32_t)feifshift << 0) & ~((uint32_t)0x00001FFF)) == 0);
    REG_RPL_WR(MDM_FCS_IFMHZ_ADDR, (uint32_t)feifshift << 0);
}

/**
 * @brief RXGFSK_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     07      LE_DFE_FORCERAW   1
 *     03      BT_DFE_FORCERAW   0
 *     02             GFO_ENPL   1
 *     01             GFO_ENSW   1
 *     00            PSD_AVGEN   1
 * </pre>
 */
#define MDM_RXGFSK_CNTL_ADDR   0x000000A0
#define MDM_RXGFSK_CNTL_OFFSET 0x000000A0
#define MDM_RXGFSK_CNTL_INDEX  0x00000028
#define MDM_RXGFSK_CNTL_RESET  0x00000087

__INLINE uint32_t mdm_rxgfsk_cntl_get(void)
{
    return REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);
}

__INLINE void mdm_rxgfsk_cntl_set(uint32_t value)
{
    REG_RPL_WR(MDM_RXGFSK_CNTL_ADDR, value);
}

// field definitions
#define MDM_LE_DFE_FORCERAW_BIT    ((uint32_t)0x00000080)
#define MDM_LE_DFE_FORCERAW_POS    7
#define MDM_BT_DFE_FORCERAW_BIT    ((uint32_t)0x00000008)
#define MDM_BT_DFE_FORCERAW_POS    3
#define MDM_GFO_ENPL_BIT           ((uint32_t)0x00000004)
#define MDM_GFO_ENPL_POS           2
#define MDM_GFO_ENSW_BIT           ((uint32_t)0x00000002)
#define MDM_GFO_ENSW_POS           1
#define MDM_PSD_AVGEN_BIT          ((uint32_t)0x00000001)
#define MDM_PSD_AVGEN_POS          0

#define MDM_LE_DFE_FORCERAW_RST    0x1
#define MDM_BT_DFE_FORCERAW_RST    0x0
#define MDM_GFO_ENPL_RST           0x1
#define MDM_GFO_ENSW_RST           0x1
#define MDM_PSD_AVGEN_RST          0x1

__INLINE void mdm_rxgfsk_cntl_pack(uint8_t ledfeforceraw, uint8_t btdfeforceraw, uint8_t gfoenpl, uint8_t gfoensw, uint8_t psdavgen)
{
    ASSERT_ERR((((uint32_t)ledfeforceraw << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)btdfeforceraw << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)gfoenpl << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)gfoensw << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)psdavgen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(MDM_RXGFSK_CNTL_ADDR,  ((uint32_t)ledfeforceraw << 7) | ((uint32_t)btdfeforceraw << 3) | ((uint32_t)gfoenpl << 2) | ((uint32_t)gfoensw << 1) | ((uint32_t)psdavgen << 0));
}

__INLINE void mdm_rxgfsk_cntl_unpack(uint8_t* ledfeforceraw, uint8_t* btdfeforceraw, uint8_t* gfoenpl, uint8_t* gfoensw, uint8_t* psdavgen)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);

    *ledfeforceraw = (localVal & ((uint32_t)0x00000080)) >> 7;
    *btdfeforceraw = (localVal & ((uint32_t)0x00000008)) >> 3;
    *gfoenpl = (localVal & ((uint32_t)0x00000004)) >> 2;
    *gfoensw = (localVal & ((uint32_t)0x00000002)) >> 1;
    *psdavgen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t mdm_le_dfe_forceraw_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void mdm_le_dfe_forceraw_setf(uint8_t ledfeforceraw)
{
    ASSERT_ERR((((uint32_t)ledfeforceraw << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(MDM_RXGFSK_CNTL_ADDR, (REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)ledfeforceraw << 7));
}

__INLINE uint8_t mdm_bt_dfe_forceraw_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void mdm_bt_dfe_forceraw_setf(uint8_t btdfeforceraw)
{
    ASSERT_ERR((((uint32_t)btdfeforceraw << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(MDM_RXGFSK_CNTL_ADDR, (REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)btdfeforceraw << 3));
}

__INLINE uint8_t mdm_gfo_enpl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_RXGFSK_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

