aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_modem.h
__INLINE void mdm_gsg_lstval_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_LSTVAL_ADDR, value);
}

// field definitions
#define MDM_GSG_LSTVAL_MASK   ((uint32_t)0x0000003F)
#define MDM_GSG_LSTVAL_LSB    0
#define MDM_GSG_LSTVAL_WIDTH  ((uint32_t)0x00000006)

#define MDM_GSG_LSTVAL_RST    0x14

__INLINE uint8_t mdm_gsg_lstval_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_LSTVAL_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000003F)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_gsg_lstval_setf(uint8_t gsglstval)
{
    ASSERT_ERR((((uint32_t)gsglstval << 0) & ~((uint32_t)0x0000003F)) == 0);
    REG_RPL_WR(MDM_GSG_LSTVAL_ADDR, (uint32_t)gsglstval << 0);
}

/**
 * @brief GSG_NOM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  07:00              GSG_NOM   0x1
 * </pre>
 */
#define MDM_GSG_NOM_ADDR   0x000000C2
#define MDM_GSG_NOM_OFFSET 0x000000C2
#define MDM_GSG_NOM_INDEX  0x00000030
#define MDM_GSG_NOM_RESET  0x00000001

__INLINE uint32_t mdm_gsg_nom_get(void)
{
    return REG_RPL_RD(MDM_GSG_NOM_ADDR);
}

__INLINE void mdm_gsg_nom_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_NOM_ADDR, value);
}

// field definitions
#define MDM_GSG_NOM_MASK   ((uint32_t)0x000000FF)
#define MDM_GSG_NOM_LSB    0
#define MDM_GSG_NOM_WIDTH  ((uint32_t)0x00000008)

#define MDM_GSG_NOM_RST    0x1

__INLINE uint8_t mdm_gsg_nom_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_NOM_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000000FF)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_gsg_nom_setf(uint8_t gsgnom)
{
    ASSERT_ERR((((uint32_t)gsgnom << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(MDM_GSG_NOM_ADDR, (uint32_t)gsgnom << 0);
}

/**
 * @brief GSG_THREPS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  04:00           GSG_THREPS   0x7
 * </pre>
 */
#define MDM_GSG_THREPS_ADDR   0x000000C3
#define MDM_GSG_THREPS_OFFSET 0x000000C3
#define MDM_GSG_THREPS_INDEX  0x00000030
#define MDM_GSG_THREPS_RESET  0x00000007

__INLINE uint32_t mdm_gsg_threps_get(void)
{
    return REG_RPL_RD(MDM_GSG_THREPS_ADDR);
}

__INLINE void mdm_gsg_threps_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_THREPS_ADDR, value);
}

// field definitions
#define MDM_GSG_THREPS_MASK   ((uint32_t)0x0000001F)
#define MDM_GSG_THREPS_LSB    0
#define MDM_GSG_THREPS_WIDTH  ((uint32_t)0x00000005)

#define MDM_GSG_THREPS_RST    0x7

__INLINE uint8_t mdm_gsg_threps_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_THREPS_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000001F)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_gsg_threps_setf(uint8_t gsgthreps)
{
    ASSERT_ERR((((uint32_t)gsgthreps << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(MDM_GSG_THREPS_ADDR, (uint32_t)gsgthreps << 0);
}

/**
 * @brief GSG_VCOMMON_DEN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  04:00          GSG_VCOMMON_DEN   0x6
 * </pre>
 */
#define MDM_GSG_VCOMMON_DEN_ADDR   0x000000C4
#define MDM_GSG_VCOMMON_DEN_OFFSET 0x000000C4
#define MDM_GSG_VCOMMON_DEN_INDEX  0x00000031
#define MDM_GSG_VCOMMON_DEN_RESET  0x00000006

__INLINE uint32_t mdm_gsg_vcommon_den_get(void)
{
    return REG_RPL_RD(MDM_GSG_VCOMMON_DEN_ADDR);
}

__INLINE void mdm_gsg_vcommon_den_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_VCOMMON_DEN_ADDR, value);
}

// field definitions
#define MDM_GSG_VCOMMON_DEN_MASK   ((uint32_t)0x0000001F)
#define MDM_GSG_VCOMMON_DEN_LSB    0
#define MDM_GSG_VCOMMON_DEN_WIDTH  ((uint32_t)0x00000005)

#define MDM_GSG_VCOMMON_DEN_RST    0x6

__INLINE uint8_t mdm_gsg_vcommon_den_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_VCOMMON_DEN_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000001F)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_gsg_vcommon_den_setf(uint8_t gsgvcoden)
{
    ASSERT_ERR((((uint32_t)gsgvcoden << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(MDM_GSG_VCOMMON_DEN_ADDR, (uint32_t)gsgvcoden << 0);
}

/**
 * @brief GSG_VCOMMON_NOM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  07:00          GSG_VCOMMON_NOM   0x27
 * </pre>
 */
#define MDM_GSG_VCOMMON_NOM_ADDR   0x000000C5
#define MDM_GSG_VCOMMON_NOM_OFFSET 0x000000C5
#define MDM_GSG_VCOMMON_NOM_INDEX  0x00000031
#define MDM_GSG_VCOMMON_NOM_RESET  0x00000027

__INLINE uint32_t mdm_gsg_vcommon_nom_get(void)
{
    return REG_RPL_RD(MDM_GSG_VCOMMON_NOM_ADDR);
}

__INLINE void mdm_gsg_vcommon_nom_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_VCOMMON_NOM_ADDR, value);
}

// field definitions
#define MDM_GSG_VCOMMON_NOM_MASK   ((uint32_t)0x000000FF)
#define MDM_GSG_VCOMMON_NOM_LSB    0
#define MDM_GSG_VCOMMON_NOM_WIDTH  ((uint32_t)0x00000008)

#define MDM_GSG_VCOMMON_NOM_RST    0x27

__INLINE uint8_t mdm_gsg_vcommon_nom_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_VCOMMON_NOM_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000000FF)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_gsg_vcommon_nom_setf(uint8_t gsgvconom)
{
    ASSERT_ERR((((uint32_t)gsgvconom << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(MDM_GSG_VCOMMON_NOM_ADDR, (uint32_t)gsgvconom << 0);
}

/**
 * @brief FM2PSW_LAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  03:00           FM2PSW_LAT   0x0
 * </pre>
 */
#define MDM_FM2PSW_LAT_ADDR   0x000000C6
#define MDM_FM2PSW_LAT_OFFSET 0x000000C6
#define MDM_FM2PSW_LAT_INDEX  0x00000031
#define MDM_FM2PSW_LAT_RESET  0x00000000

__INLINE uint32_t mdm_fm2psw_lat_get(void)
{
    return REG_RPL_RD(MDM_FM2PSW_LAT_ADDR);
}

__INLINE void mdm_fm2psw_lat_set(uint32_t value)
{
    REG_RPL_WR(MDM_FM2PSW_LAT_ADDR, value);
}

// field definitions
#define MDM_FM2PSW_LAT_MASK   ((uint32_t)0x0000000F)
#define MDM_FM2PSW_LAT_LSB    0
#define MDM_FM2PSW_LAT_WIDTH  ((uint32_t)0x00000004)

#define MDM_FM2PSW_LAT_RST    0x0

__INLINE uint8_t mdm_fm2psw_lat_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_FM2PSW_LAT_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000000F)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_fm2psw_lat_setf(uint8_t fm2pswlat)
{
    ASSERT_ERR((((uint32_t)fm2pswlat << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(MDM_FM2PSW_LAT_ADDR, (uint32_t)fm2pswlat << 0);
}

/**
 * @brief GSG_DPHI_DEN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  19:16      LE_GSG_DPHI_DEN   0x5
 *  03:00      BT_GSG_DPHI_DEN   0x0
 * </pre>
 */
#define MDM_GSG_DPHI_DEN_ADDR   0x000000C7
#define MDM_GSG_DPHI_DEN_OFFSET 0x000000C7
#define MDM_GSG_DPHI_DEN_INDEX  0x00000031
#define MDM_GSG_DPHI_DEN_RESET  0x00050000

__INLINE uint32_t mdm_gsg_dphi_den_get(void)
{
    return REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR);
}

__INLINE void mdm_gsg_dphi_den_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_DPHI_DEN_ADDR, value);
}

