aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_modem.h
// field definitions
#define MDM_LE_GSG_DPHI_DEN_MASK   ((uint32_t)0x000F0000)
#define MDM_LE_GSG_DPHI_DEN_LSB    16
#define MDM_LE_GSG_DPHI_DEN_WIDTH  ((uint32_t)0x00000004)
#define MDM_BT_GSG_DPHI_DEN_MASK   ((uint32_t)0x0000000F)
#define MDM_BT_GSG_DPHI_DEN_LSB    0
#define MDM_BT_GSG_DPHI_DEN_WIDTH  ((uint32_t)0x00000004)

#define MDM_LE_GSG_DPHI_DEN_RST    0x5
#define MDM_BT_GSG_DPHI_DEN_RST    0x0

__INLINE void mdm_gsg_dphi_den_pack(uint8_t legsgdphiden, uint8_t btgsgdphiden)
{
    ASSERT_ERR((((uint32_t)legsgdphiden << 16) & ~((uint32_t)0x000F0000)) == 0);
    ASSERT_ERR((((uint32_t)btgsgdphiden << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(MDM_GSG_DPHI_DEN_ADDR,  ((uint32_t)legsgdphiden << 16) | ((uint32_t)btgsgdphiden << 0));
}

__INLINE void mdm_gsg_dphi_den_unpack(uint8_t* legsgdphiden, uint8_t* btgsgdphiden)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR);

    *legsgdphiden = (localVal & ((uint32_t)0x000F0000)) >> 16;
    *btgsgdphiden = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

__INLINE uint8_t mdm_le_gsg_dphi_den_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR);
    return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__INLINE void mdm_le_gsg_dphi_den_setf(uint8_t legsgdphiden)
{
    ASSERT_ERR((((uint32_t)legsgdphiden << 16) & ~((uint32_t)0x000F0000)) == 0);
    REG_RPL_WR(MDM_GSG_DPHI_DEN_ADDR, (REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR) & ~((uint32_t)0x000F0000)) | ((uint32_t)legsgdphiden << 16));
}

__INLINE uint8_t mdm_bt_gsg_dphi_den_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

__INLINE void mdm_bt_gsg_dphi_den_setf(uint8_t btgsgdphiden)
{
    ASSERT_ERR((((uint32_t)btgsgdphiden << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(MDM_GSG_DPHI_DEN_ADDR, (REG_RPL_RD(MDM_GSG_DPHI_DEN_ADDR) & ~((uint32_t)0x0000000F)) | ((uint32_t)btgsgdphiden << 0));
}

/**
 * @brief GSG_DPHI_NOM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  22:16      LE_GSG_DPHI_NOM   0x35
 *  06:00      BT_GSG_DPHI_NOM   0x1
 * </pre>
 */
#define MDM_GSG_DPHI_NOM_ADDR   0x000000C8
#define MDM_GSG_DPHI_NOM_OFFSET 0x000000C8
#define MDM_GSG_DPHI_NOM_INDEX  0x00000032
#define MDM_GSG_DPHI_NOM_RESET  0x00350001

__INLINE uint32_t mdm_gsg_dphi_nom_get(void)
{
    return REG_RPL_RD(MDM_GSG_DPHI_NOM_ADDR);
}

__INLINE void mdm_gsg_dphi_nom_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_DPHI_NOM_ADDR, value);
}

// field definitions
#define MDM_LE_GSG_DPHI_NOM_MASK   ((uint32_t)0x007F0000)
#define MDM_LE_GSG_DPHI_NOM_LSB    16
#define MDM_LE_GSG_DPHI_NOM_WIDTH  ((uint32_t)0x00000007)
#define MDM_BT_GSG_DPHI_NOM_MASK   ((uint32_t)0x0000007F)
#define MDM_BT_GSG_DPHI_NOM_LSB    0
#define MDM_BT_GSG_DPHI_NOM_WIDTH  ((uint32_t)0x00000007)

#define MDM_LE_GSG_DPHI_NOM_RST    0x35
#define MDM_BT_GSG_DPHI_NOM_RST    0x1

__INLINE void mdm_gsg_dphi_nom_pack(uint8_t legsgdphinom, uint8_t btgsgdphinom)
{
    ASSERT_ERR((((uint32_t)legsgdphinom << 16) & ~((uint32_t)0x007F0000)) == 0);
    ASSERT_ERR((((uint32_t)btgsgdphinom << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_RPL_WR(MDM_GSG_DPHI_NOM_ADDR,  ((uint32_t)legsgdphinom << 16) | ((uint32_t)btgsgdphinom << 0));
}

__INLINE void mdm_gsg_dphi_nom_unpack(uint8_t* legsgdphinom, uint8_t* btgsgdphinom)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_DPHI_NOM_ADDR);

    *legsgdphinom = (localVal & ((uint32_t)0x007F0000)) >> 16;
    *btgsgdphinom = (localVal & ((uint32_t)0x0000007F)) >> 0;
}

__INLINE uint8_t mdm_le_gsg_dphi_nom_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_DPHI_NOM_ADDR);
    return ((localVal & ((uint32_t)0x007F0000)) >> 16);
}

__INLINE void mdm_le_gsg_dphi_nom_setf(uint8_t legsgdphinom)
{
    ASSERT_ERR((((uint32_t)legsgdphinom << 16) & ~((uint32_t)0x007F0000)) == 0);
    REG_RPL_WR(MDM_GSG_DPHI_NOM_ADDR, (REG_RPL_RD(MDM_GSG_DPHI_NOM_ADDR) & ~((uint32_t)0x007F0000)) | ((uint32_t)legsgdphinom << 16));
}

__INLINE uint8_t mdm_bt_gsg_dphi_nom_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_DPHI_NOM_ADDR);
    return ((localVal & ((uint32_t)0x0000007F)) >> 0);
}

__INLINE void mdm_bt_gsg_dphi_nom_setf(uint8_t btgsgdphinom)
{
    ASSERT_ERR((((uint32_t)btgsgdphinom << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_RPL_WR(MDM_GSG_DPHI_NOM_ADDR, (REG_RPL_RD(MDM_GSG_DPHI_NOM_ADDR) & ~((uint32_t)0x0000007F)) | ((uint32_t)btgsgdphinom << 0));
}

/**
 * @brief DSG_DEN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  03:00              DSG_DEN   0x0
 * </pre>
 */
#define MDM_DSG_DEN_ADDR   0x000000D0
#define MDM_DSG_DEN_OFFSET 0x000000D0
#define MDM_DSG_DEN_INDEX  0x00000034
#define MDM_DSG_DEN_RESET  0x00000000

__INLINE uint32_t mdm_dsg_den_get(void)
{
    return REG_RPL_RD(MDM_DSG_DEN_ADDR);
}

__INLINE void mdm_dsg_den_set(uint32_t value)
{
    REG_RPL_WR(MDM_DSG_DEN_ADDR, value);
}

// field definitions
#define MDM_DSG_DEN_MASK   ((uint32_t)0x0000000F)
#define MDM_DSG_DEN_LSB    0
#define MDM_DSG_DEN_WIDTH  ((uint32_t)0x00000004)

#define MDM_DSG_DEN_RST    0x0

__INLINE uint8_t mdm_dsg_den_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_DSG_DEN_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000000F)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_dsg_den_setf(uint8_t dsgden)
{
    ASSERT_ERR((((uint32_t)dsgden << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(MDM_DSG_DEN_ADDR, (uint32_t)dsgden << 0);
}

/**
 * @brief DSG_NOM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:00              DSG_NOM   0x1
 * </pre>
 */
#define MDM_DSG_NOM_ADDR   0x000000D1
#define MDM_DSG_NOM_OFFSET 0x000000D1
#define MDM_DSG_NOM_INDEX  0x00000034
#define MDM_DSG_NOM_RESET  0x00000001

__INLINE uint32_t mdm_dsg_nom_get(void)
{
    return REG_RPL_RD(MDM_DSG_NOM_ADDR);
}

__INLINE void mdm_dsg_nom_set(uint32_t value)
{
    REG_RPL_WR(MDM_DSG_NOM_ADDR, value);
}

// field definitions
#define MDM_DSG_NOM_MASK   ((uint32_t)0x000003FF)
#define MDM_DSG_NOM_LSB    0
#define MDM_DSG_NOM_WIDTH  ((uint32_t)0x0000000A)

#define MDM_DSG_NOM_RST    0x1

__INLINE uint16_t mdm_dsg_nom_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_DSG_NOM_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000003FF)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_dsg_nom_setf(uint16_t dsgnom)
{
    ASSERT_ERR((((uint32_t)dsgnom << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(MDM_DSG_NOM_ADDR, (uint32_t)dsgnom << 0);
}


#endif // _REG_MODEM_H_

